perf-tests/results_v2_20260420_170456/webflux/hey_customers_50k.txt

Summary:
  Total:	4.2035 secs
  Slowest:	0.4334 secs
  Fastest:	0.0002 secs
  Average:	0.0401 secs
  Requests/sec:	11894.8594
  
  Total data:	37700000 bytes
  Size/request:	754 bytes

Response time histogram:
  0.000 [1]	|
  0.044 [35157]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.087 [13062]	|■■■■■■■■■■■■■■■
  0.130 [1076]	|■
  0.174 [313]	|
  0.217 [72]	|
  0.260 [124]	|
  0.303 [105]	|
  0.347 [49]	|
  0.390 [29]	|
  0.433 [12]	|


Latency distribution:
  10%% in 0.0188 secs
  25%% in 0.0268 secs
  50%% in 0.0357 secs
  75%% in 0.0460 secs
  90%% in 0.0604 secs
  95%% in 0.0783 secs
  99%% in 0.1411 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0372 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0169 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0041 secs
  resp wait:	0.0396 secs, 0.0002 secs, 0.4334 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0140 secs

Status code distribution:
  [200]	50000 responses