perf-tests/results_v2_20260420_170456/webflux/vegeta_accounts_1k.txt
Requests      [total, rate, throughput]         30000, 1000.03, 1000.02
Duration      [total, attack, wait]             29.999s, 29.999s, 356.5µs
Latencies     [min, mean, 50, 90, 95, 99, max]  257.834µs, 705.426µs, 406.32µs, 526.738µs, 660.892µs, 3.97ms, 109.361ms
Bytes In      [total, mean]                     31650000, 1055.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:30000  
Error Set: