perf-tests/results_v2_20260420_170456/webflux/vegeta_customers_100.txt
Requests      [total, rate, throughput]         3000, 100.03, 100.03
Duration      [total, attack, wait]             29.992s, 29.991s, 1.815ms
Latencies     [min, mean, 50, 90, 95, 99, max]  345.042µs, 1.941ms, 1.884ms, 3.061ms, 3.594ms, 5.684ms, 34.092ms
Bytes In      [total, mean]                     2262000, 754.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set: