perf-tests/results_v2_20260420_170456/webflux/wrk_customers_500c.txt
Running 30s test @ http://localhost:8082/customers
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    58.36ms   64.55ms 851.63ms   90.51%
    Req/Sec     1.08k   667.79     2.12k    51.10%
  256784 requests in 1.74m, 202.28MB read
  Socket errors: connect 0, read 0, write 0, timeout 1488
Requests/sec:   2452.77
Transfer/sec:      1.93MB